In [1]:
import pandas as pd
import matplotlib.pyplot as plt

In [5]:
salary=pd.read_csv(r'C:\Users\HP P DTS\Desktop\Python Classes\DataSet\salary_decision_tree.csv')

In [6]:
salary.head()

  company                  job     degree  salary_more_then_100k  Unnamed: 4
0  google      sales executive  bachelors                      0         NaN
1  google      sales executive    masters                      0         NaN
2  google     business manager  bachelors                      1         NaN
3  google     business manager    masters                      1         NaN
4  google  computer programmer  bachelors                      0         NaN

In [7]:
salary=salary.drop('Unnamed: 4',axis=1)

In [8]:
salary.head()

  company                  job     degree  salary_more_then_100k
0  google      sales executive  bachelors                      0
1  google      sales executive    masters                      0
2  google     business manager  bachelors                      1
3  google     business manager    masters                      1
4  google  computer programmer  bachelors                      0

In [9]:
from sklearn.preprocessing import LabelEncoder

In [11]:
le_com=LabelEncoder()
le_job=LabelEncoder()
le_deg=LabelEncoder()

In [13]:
salary['comp_n']=le_com.fit_transform(salary['company'])
salary['job_n']=le_job.fit_transform(salary['job'])
salary['deg_n']=le_deg.fit_transform(salary['degree'])

In [14]:
salary.head()

,company,job,degree,salary_more_then_100k,comp_n,job_n,deg_n
0,google,sales executive,bachelors,0,2,2,0
1,google,sales executive,masters,0,2,2,1
2,google,business manager,bachelors,1,2,0,0
3,google,business manager,masters,1,2,0,1
4,google,computer programmer,bachelors,0,2,1,0

In [15]:
X=salary.drop(['company','job','degree','salary_more_then_100k'],axis=1)

In [16]:
print(X)

    comp_n  job_n  deg_n
0        2      2      0
1        2      2      1
2        2      0      0
3        2      0      1
4        2      1      0
5        2      1      1
6        0      2      1
7        0      1      0
8        0      0      0
9        0      0      1
10       1      2      0
11       1      2      1
12       1      0      0
13       1      0      1
14       1      1      0
15       1      1      1

In [17]:
y=salary['salary_more_then_100k']

In [18]:
print(y)

0     0
1     0
2     1
3     1
4     0
5     1
6     0
7     0
8     0
9     1
10    1
11    1
12    1
13    1
14    1
15    1
Name: salary_more_then_100k, dtype: int64

In [19]:
from sklearn.model_selection import train_test_split

In [28]:
X_train,x_test,y_train,y_test=train_test_split(X,y,test_size=0.2)

In [29]:
X_train.shape

(12, 3)

In [22]:
salary.shape

(16, 7)

In [30]:
y_train

13    1
5     1
14    1
1     0
11    1
8     0
6     0
0     0
3     1
4     0
7     0
9     1
Name: salary_more_then_100k, dtype: int64

In [31]:
from sklearn.tree import DecisionTreeClassifier
model=DecisionTreeClassifier()

In [32]:
model.fit(X_train,y_train)

DecisionTreeClassifier(class_weight=None, criterion='gini', max_depth=None,
                       max_features=None, max_leaf_nodes=None,
                       min_impurity_decrease=0.0, min_impurity_split=None,
                       min_samples_leaf=1, min_samples_split=2,
                       min_weight_fraction_leaf=0.0, presort=False,
                       random_state=None, splitter='best')

In [39]:
pred=model.predict(x_test)

In [35]:
y_test

15    1
12    1
2     1
10    1
Name: salary_more_then_100k, dtype: int64

In [40]:
model.score(x_test,pred)

1.0

In [ ]:
model.predict([[]])

In [38]:
salary['company'].unique()

array(['google', 'abc pharma', 'facebook'], dtype=object)

In [41]:
pred

array([1, 1, 0, 1], dtype=int64)

In [42]:
y_test

15    1
12    1
2     1
10    1
Name: salary_more_then_100k, dtype: int64

In [43]:
x_test

    comp_n  job_n  deg_n
15       1      1      1
12       1      0      0
2        2      0      0
10       1      2      0

In [46]:
model.predict([[1,1,1]])

array([1], dtype=int64)

In [47]:
y_test

15    1
12    1
2     1
10    1
Name: salary_more_then_100k, dtype: int64

In [48]:
model.predict([[1,1,0]])

array([1], dtype=int64)

In [49]:
salary

,company,job,degree,salary_more_then_100k,comp_n,job_n,deg_n
0,google,sales executive,bachelors,0,2,2,0
1,google,sales executive,masters,0,2,2,1
2,google,business manager,bachelors,1,2,0,0
3,google,business manager,masters,1,2,0,1
4,google,computer programmer,bachelors,0,2,1,0
5,google,computer programmer,masters,1,2,1,1
6,abc pharma,sales executive,masters,0,0,2,1
7,abc pharma,computer programmer,bachelors,0,0,1,0
8,abc pharma,business manager,bachelors,0,0,0,0
9,abc pharma,business manager,masters,1,0,0,1
10,facebook,sales executive,bachelors,1,1,2,0
11,facebook,sales executive,masters,1,1,2,1
12,facebook,business manager,bachelors,1,1,0,0
13,facebook,business manager,masters,1,1,0,1
14,facebook,computer programmer,bachelors,1,1,1,0
15,facebook,computer programmer,masters,1,1,1,1

In [50]:
#iris data